export function poetry(verse) {
    let result = null;
    const poetries = {
        poetry1: "اشک گرم و آه سرد و روی زرد و سوز دل  حاصل عشقند و من این نکته می‌دانم چو شمع",
        poetry2: "عارضش را به مثل ماه فلک نتوان  گفت نسبت دوست بهر بی سر و پا نتوان گفت",
        poetry3: "تو همچو صبحی من شمع خلوت سحرم  تبسمی کن و جان بین که همی سپرم",
        poetry4: "مزرع سبز فلک دیدم و داس مه نو یادم  از کشته‌ی خویش آمد و هنگام درو",
        poetry5: "وفا کنیم  ملامت کشیم  خوش باشیم  که در طریقت ما کافریست رنجیدن",
        poetry6: "نصیب کوردلان است نعمت دنیا تو  چشم رشد و تمیزی همین گناهت بس",
        poetry7: "شراب خانگیِ ترس محتسب خورده به  روی یار بنوشیم و بانگ نوشانوش",
        poetry8: "شا‌ها فلک از بزم تو در رقص و سماع است  دست طرب از دامن این زمزمه مگسل",
        poetry9: "لاف عشق و گله از یار زهی لاف  دروغ عشقبازان چنین مستحق هجرانند",
        poetry10: "دل همچو سنگت‌ ای دوست به آب چشم سعدی عجب  است اگر نگردد که بگردد آسیابی"
    }

    for (const pot of Object.values(poetries)) {
        let mesra = pot.split("  ")[0]
        if (verse.charAt(verse.length - 1) === pot.charAt(0) || verse.charAt(verse.length - 1) === mesra.charAt(mesra.length - 1)) {
            result = pot
        }
    }
    return result;
}